000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыПроблемныеДоВыяснения/ОбъектыПроблемныеДоВыяснения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыПроблемныеДоВыяснения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовДоВыяснения</types>
    </type>
  </resources>
  <resources>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МоментСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Альтернатива</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>DocumentRef.КорректировкаПеремещения</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <comment>Пустой - по всем магазинам</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыПроблемныеДоВыяснения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаписьСуществует(КлючиЗаписи)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ОбъектыПроблемныеДоВыяснения КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Объект = &Объект
	|	И ТаблицаРегистра.Магазин = &Магазин
	|	И ТаблицаРегистра.Статус = &Статус
	|	И ТаблицаРегистра.Источник = &Источник
	|	И (ВЫРАЗИТЬ(ТаблицаРегистра.Комментарий КАК СТРОКА(800))) = (ВЫРАЗИТЬ(&Комментарий КАК СТРОКА(800)))"
	);
	Запрос.УстановитьПараметр("Объект"		, КлючиЗаписи.Объект);
	Запрос.УстановитьПараметр("Магазин"		, КлючиЗаписи.Магазин);
	Запрос.УстановитьПараметр("Статус"		, КлючиЗаписи.Статус);
	Запрос.УстановитьПараметр("Источник"	, КлючиЗаписи.Источник);
	Запрос.УстановитьПараметр("Комментарий"	, КлючиЗаписи.Комментарий);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
